# Core Tool
brew "chezmoi"        # Dotfiles manager
brew "mise"           # Runtime manager
brew "sheldon"        # Zsh plugin manager

# CLI Tool
brew "bat"            # cat alternative
brew "eza"            # ls alternative
brew "fastfetch"      # System info
brew "fd"             # find alternative
brew "fzf"            # Fuzzy finder
brew "procs"          # ps alternative
brew "ripgrep"        # grep alternative
brew "zoxide"         # cd alternative

# Standard Utility
brew "curl"
brew "ffmpeg"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "nkf"
brew "nmap"
brew "tcpdump"
brew "tree"
brew "unzip"
brew "wget"
brew "zip"

# Editor / Multiplexer
brew "tmux"
brew "tmuxinator"
brew "vim"

# Git
brew "git-delta"
brew "git"
brew "tig"

# Cloud / Infrastructure
brew "terraform"
# brew "awscli" install manually

# Cask - Development
cask "claude-code"
cask "claude"
cask "datagrip"
cask "docker-desktop"
cask "ghostty"
cask "visual-studio-code"
# cask "gcloud-cli" install manually

# Cask - System Extension
cask "google-japanese-ime"
cask "karabiner-elements"
cask "wireshark-app"

# Cask - Browser
cask "google-chrome"

# Cask - Productivity / Communication
cask "antinote"
cask "figma"
cask "notion"
cask "slack"
cask "ticktick"

# Cask - Multimedia
cask "vlc"

# Cask - Font
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
